## 데이터 베이스 설치 

- pip install pymysql

In [1]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql

In [2]:
import mysql.connector

In [3]:
mysql_con = mysql.connector.connect(host='127.0.0.1', port='3306', database='sakila', user='root', password='')

In [4]:
pd.read_sql_query('show databases', mysql_con)

/var/folders/h4/44486vyn1_xbs13g1z50l5m00000gn/T/ipykernel_21563/3140938958.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query('show databases', mysql_con)

             Database
0  information_schema
1           modu_chat
2                mydb
3               mysql
4  performance_schema
5              sakila
6                 sys

In [5]:
df2 = pd.read_sql('select * from actor limit 10', mysql_con)

/var/folders/h4/44486vyn1_xbs13g1z50l5m00000gn/T/ipykernel_21563/52531566.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2 = pd.read_sql('select * from actor limit 10', mysql_con)

In [6]:
df2

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
5         6      BETTE     NICHOLSON 2006-02-15 04:34:33
6         7      GRACE        MOSTEL 2006-02-15 04:34:33
7         8    MATTHEW     JOHANSSON 2006-02-15 04:34:33
8         9        JOE         SWANK 2006-02-15 04:34:33
9        10  CHRISTIAN         GABLE 2006-02-15 04:34:33

In [7]:
pymysql.install_as_MySQLdb()

In [8]:
db_connection_path = 'mysql+pymysql://root:@127.0.0.1:3306/sakila'
db_connection = create_engine(db_connection_path)

In [9]:
conn1 = db_connection.connect()

In [10]:
db_name = 'sakila'
db_id =  'root'
db_ip = '127.0.0.1' # 자신의 로컬컴퓨터
db_passwd = ''
db_port = '3306'

In [11]:
lll = f"mysql+pymysql://{db_id}:{db_passwd}@{db_ip }:{db_port}/{db_name}"

In [12]:
lll

'mysql+pymysql://root:@127.0.0.1:3306/sakila'

In [13]:
engine = create_engine(lll)

In [14]:
conn2 = engine.connect()

In [21]:
from sqlalchemy import sql
sql_query = sql.text('show databases')

In [22]:
pd.read_sql(sql_query, con=conn2)

             Database
0  information_schema
1           modu_chat
2                mydb
3               mysql
4  performance_schema
5              sakila
6                 sys

In [23]:
sql_query = sql.text('select * from actor limit 10')

df1 = pd.read_sql_query(sql_query, conn1)

In [24]:
df1

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
5         6      BETTE     NICHOLSON 2006-02-15 04:34:33
6         7      GRACE        MOSTEL 2006-02-15 04:34:33
7         8    MATTHEW     JOHANSSON 2006-02-15 04:34:33
8         9        JOE         SWANK 2006-02-15 04:34:33
9        10  CHRISTIAN         GABLE 2006-02-15 04:34:33

In [18]:
conn = pymysql.connect(host = '127.0.0.1',
                       port = 3306,
                       user = 'root',
                       password = '',
                       db = 'sakila')

In [19]:

df = pd.read_sql_query('select * from actor limit 10', conn)

/var/folders/h4/44486vyn1_xbs13g1z50l5m00000gn/T/ipykernel_21563/938292750.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('select * from actor limit 10', conn)

In [20]:
df

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
5         6      BETTE     NICHOLSON 2006-02-15 04:34:33
6         7      GRACE        MOSTEL 2006-02-15 04:34:33
7         8    MATTHEW     JOHANSSON 2006-02-15 04:34:33
8         9        JOE         SWANK 2006-02-15 04:34:33
9        10  CHRISTIAN         GABLE 2006-02-15 04:34:33